OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pisoFoam/RAS/cavity/system/FOs/FOrandomise
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

randomise1
{
    // Mandatory entries
    type            randomise;
    libs            (fieldFunctionObjects);
    magPerturbation 0.1;
    field           U;

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       0.25;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 5;
    writeControl    timeStep;
    writeInterval   25;
}


// ************************************************************************* //
